using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TODO 
{
    // TODO ¬ WindowOption в методе SetDeActiveAIWindow(), при срабатывании else нужно сделать автоматисеский поиск и создание окна таблицы параметров AI, дл€ избегани€ ситуации когда слетаю ссылки в _tableAIInOPtion
    // TODO при сражении из флота вылетаю и "падают" маленькие копии флотского корабл€, на каждый уничтоженный карабль внутри флота
    // TODO  артинка на загрузке (load, сцена) должна бударажить воображение, дл€ создани€ настроени€.

    //‘Ћќ“

    // + TODO если на защиту встает несколько флотов друг за другом сделать merg
    //TODO анимировать добавлением флота к другому флоту =>
    //большой флот рассыпаетс€ на мелкие корабли, которые лет€т к основному флоту, в конце анимации основной флот увеличиваетс€ на то кол-во кораблей которое летело во втором флоте
    //TODO при захвате планеты, необходимо сделать проврку, есть ли стро€щийс€ корабли, если есть, то передать их новому владельцу.
    // + TODO в ParentManager в DisplaySolarium заменить FindGameObjectWithTag на event system  
    //TODO в Shipyard в BuildShipInShipyard убрать проверку на достаточность солариума и вынести проврку через событие.
    //“.е. окошки на планетах подписываютс€ на событие, в паранте крутим проверку на достаточность —ола дл€ постройки, если ок, то запускаем
    //соответствующий event, если нет, то лругой event за затемнение и диактивизацию окошка
    //TODO Scale сделать через DotTween
    //TODO ” каждого корабл€ сделать две полоски, структура и щиты. —труктура красна€, щиты син€€. –асчет происходит по общему сумме щитов
    //и структуры всех кораблей одного типа. 
}
