using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TODO 
{
    // TODO В WindowOption в методе SetDeActiveAIWindow(), при срабатывании else нужно сделать автоматисеский поиск и создание окна таблицы параметров AI, для избегания ситуации когда слетаю ссылки в _tableAIInOPtion
    // TODO при сражении из флота вылетаю и "падают" маленькие копии флотского корабля, на каждый уничтоженный карабль внутри флота
    // TODO Картинка на загрузке (load, сцена) должна бударажить воображение, для создания настроения.

    //ФЛОТ

    //TODO если на защиту встает несколько флотов друг за другом сделать merg
    //TODO анимировать добавлением флота к другому флоту =>
    // => большой флот рассыпается на мелкие корабли, которые летят к основному флоту, в конце анимации основной флот увеличивается на то кол-во кораблей которое летело во втором флоте
}
