using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TODO 
{
    // TODO ¬ WindowOption в методе SetDeActiveAIWindow(), при срабатывании else нужно сделать автоматисеский поиск и создание окна таблицы параметров AI, дл€ избегани€ ситуации когда слетаю ссылки в _tableAIInOPtion
    // TODO при сражении из флота вылетаю и "падают" маленькие копии флотского корабл€, на каждый уничтоженный карабль внутри флота
    // TODO  артинка на загрузке (load, сцена) должна бударажить воображение, дл€ создани€ настроени€.

    //‘Ћќ“

    //TODO во FleetState,  CheckOtherAttackersFleetFromOnePlanetToJoin() если проверка наличие атакующего флота вылетившего с одной  итой же планеты прошла
    //успешно, то надос делать, что бы добавление фллота было анимированным и за некоторой дистанцией до точки атаки.
    // большой флот рассыпаетс€ на мелкие корабли, которые лет€т к основному флоту, в конце анимации основной флот увеличиваетс€ на то кол-во кораблей которое летело во втором флоте
}
